app/views/courses/show.html.erb

      <hr>
      <% @course.assignments.each do |a| %>
---
SELECT "assignments".* FROM "assignments" WHERE "assignments"."course_id" = $1  [["course_id", 1]]