app/controllers/assignments_controller.rb

  def index
    @course = Course.find_by_id(params[:course_id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def show
    @assignment = Assignment.find_by_id(params[:id])
---
SELECT  "assignments".* FROM "assignments" WHERE "assignments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def new
   @assignment = Assignment.new
   @course = Course.find_by_id(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def edit
    assignment_id = params[:id]
    @assignment = Assignment.find_by_id(assignment_id)
---
SELECT  "assignments".* FROM "assignments" WHERE "assignments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    new_assignment = Assignment.new(assignment_params)
    @course = Course.find_by_id(params[:id])
    new_assignment.course  = @course
    if @assignment = new_assignment.save
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "assignments" ("title", "instructions", "assign_date", "due_date", "duration", "visible", "course_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"