app/controllers/students_controller.rb

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    @course = Course.find_by_id(params[:course_id])

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @course = Course.find_by_id(params[:course_id])
    @student = Student.find_by_id(params[:id])

SELECT  "courses".* FROM "courses" WHERE "courses"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
  def new
    @student = Student.new
    @course = Course.find_by_id(params[:course_id])

SELECT  "courses".* FROM "courses" ORDER BY "courses"."id" DESC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "students" ("first_name", "last_name", "user_name", "email", "password_digest", "slack", "github", "linkedin", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @course = Course.last
    student = Student.new(student_params)
      if student.save

SELECT  "courses".* FROM "courses" WHERE "courses"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @course = Course.find_by_id(params[:course_id])
    @student = Student.find_by_id(params[:id])

SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "user_name" = $1, "updated_at" = $2 WHERE "students"."id" = $3  [["user_name", "Arr"], ["updated_at", 2017-02-10 04:46:28 UTC], ["id", 1]]
---
  def update
    student_id = params[:id]
      @student = Student.find_by_id(student_id)

      if @student.update_attributes(student_params)