app/controllers/teachers_controller.rb

  def index
    @course = Course.find_by_id(params[:course_id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def show
    @course = Course.find_by_id(params[:course_id])
    @teacher = Teacher.find_by_id(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]

  def new
    @teacher = Teacher.new
    @course = Course.find_by_id(params[:course_id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" IS NULL LIMIT $1  [["LIMIT", 1]]

  def create
    @course = Course.last
    teacher = Teacher.new(teacher_params)
      if teacher.save
---
SELECT  "courses".* FROM "courses" ORDER BY "courses"."id" DESC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "teachers" ("first_name", "last_name", "user_name", "password_digest", "email", "slack", "github", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def edit
    @course = Course.find_by_id(params[:course_id])
    @teacher = Teacher.find_by_id(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    teacher_id = params[:id]
      @teacher = Teacher.find_by_id(teacher_id)

      if @teacher.update_attributes(teacher_params)
---
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "teachers" SET "last_name" = $1, "updated_at" = $2 WHERE "teachers"."id" = $3  [["last_name", "Foioioi"], ["updated_at", 2017-02-10 04:42:47 UTC], ["id", 1]]